ruby-on-rails/hw3-acceptance-unit-test-cycle/rottenpotatoes/app/controllers/movies_controller.rb

INSERT INTO "movies" ("title", "rating", "director", "release_date", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["title", "test"], ["rating", "G"], ["director", ""], ["release_date", "2019-03-26 00:00:00.000000"], ["created_at", "2019-03-26 15:05:09.399706"], ["updated_at", "2019-03-26 15:05:09.399706"]]
---
  def create
    @movie = Movie.create!(movie_params)

SELECT  "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "movies" SET "title" = ?, "release_date" = ?, "director" = ?, "updated_at" = ? WHERE "movies"."id" = ?  [["title", "Annabelle"], ["release_date", "2014-10-03 00:00:00.000000"], ["director", "John Leonetti"], ["updated_at", "2019-03-27 01:48:48.741665"], ["id", 1]]
---
  def update
    @movie = Movie.find params[:id]
    @movie.update_attributes!(movie_params)

SELECT  "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT 1  [["id", 1]]
---
  def same_director
    @movie = Movie.find params[:id]